tap "homebrew/bundle"
tap "tdewolff/tap"

brew "asm-lsp"
brew "basedpyright"
brew "bash"
brew "cmake"
brew "difftastic"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gcc"
brew "gh"
brew "git-lfs"
brew "gnupg"
brew "go"
brew "gofumpt"
brew "golangci-lint"
brew "golangci-lint-langserver"
brew "gopls"
brew "govulncheck"
brew "graphviz"
brew "jpeg-xl"
brew "jq"
brew "libavif"
brew "llvm"
brew "lua-language-server"
brew "make"
brew "minify"
brew "neovim"
brew "pandoc"
brew "pigz"
brew "pyright"
brew "python"
brew "ripgrep"
brew "ruff"
brew "ruff-lsp"
brew "rust-analyzer"
brew "staticcheck"
brew "swiftformat"
brew "swiftlint"
brew "tombi"
brew "tree-sitter-cli"
brew "ty"
brew "uv"
brew "vscode-langservers-extracted"
brew "webp"
brew "yt-dlp"

cask "discord"
cask "figma"
cask "font-source-code-pro"
cask "github"
cask "google-chrome"
cask "iina"
cask "notion"
cask "rectangle"
cask "visual-studio-code"
cask "zed"
